CED/PC03-CC3S2-Grupo-07/rottenpotatoes-rails-intro/app/controllers/movies_controller.rb

  def index
    # Obtener todas las películas o filtrar por calificaciones seleccionadas
    @movies = Movie.all
---
SELECT "movies".* FROM "movies"  ORDER BY release_date asc

  def create
    begin
      raise TitleEmptyError, "El titulo no puede estar vacío" if movie_params[:title].blank?
      raise TitleFormatError, "EL titulo no puede contener el caracter #" if movie_params[:title].include?("#")
      if (@movie = Movie.create!(movie_params))
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["rating", "G"], ["release_date", "2023-11-20 00:00:00.000000"], ["created_at", "2023-11-20 16:13:52.227045"], ["updated_at", "2023-11-20 16:13:52.227045"]]